## Staging: sqs
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 3 to add, 0 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                      NAME                      |
|----------|------------------------------------------------|
| recreate | `aws_sqs_queue.reliability_deadletter_queue`   |
|          | `aws_sqs_queue.reliability_queue`              |
| add      | `aws_sqs_queue.reliability_reprocessing_queue` |
| delete   | `aws_sqs_queue.reprocess_submission_queue`     |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_sqs_queue.reliability_deadletter_queue must be replaced
-/+ resource "aws_sqs_queue" "reliability_deadletter_queue" {
      ~ arn                               = "arn:aws:sqs:ca-central-1:687401027353:reliability_deadletter_queue.fifo" -> (known after apply)
      ~ content_based_deduplication       = true -> false
      ~ deduplication_scope               = "queue" -> (known after apply)
      ~ fifo_queue                        = true -> false # forces replacement
      ~ fifo_throughput_limit             = "perQueue" -> (known after apply)
      ~ id                                = "https://sqs.ca-central-1.amazonaws.com/687401027353/reliability_deadletter_queue.fifo" -> (known after apply)
      ~ name                              = "reliability_deadletter_queue.fifo" -> "reliability_deadletter_queue" # forces replacement
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      ~ sqs_managed_sse_enabled           = false -> (known after apply)
      - tags                              = {} -> null
      ~ url                               = "https://sqs.ca-central-1.amazonaws.com/687401027353/reliability_deadletter_queue.fifo" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # aws_sqs_queue.reliability_queue must be replaced
-/+ resource "aws_sqs_queue" "reliability_queue" {
      ~ arn                               = "arn:aws:sqs:ca-central-1:687401027353:submission_processing.fifo" -> (known after apply)
      ~ content_based_deduplication       = true -> false
      ~ deduplication_scope               = "queue" -> (known after apply)
      ~ fifo_queue                        = true -> false # forces replacement
      ~ fifo_throughput_limit             = "perQueue" -> (known after apply)
      ~ id                                = "https://sqs.ca-central-1.amazonaws.com/687401027353/submission_processing.fifo" -> (known after apply)
      ~ name                              = "submission_processing.fifo" -> "reliability_queue" # forces replacement
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + redrive_allow_policy              = (known after apply)
      ~ redrive_policy                    = jsonencode(
            {
              - deadLetterTargetArn = "arn:aws:sqs:ca-central-1:687401027353:reliability_deadletter_queue.fifo"
              - maxReceiveCount     = 5
            }
        ) -> (known after apply)
      ~ sqs_managed_sse_enabled           = false -> (known after apply)
      - tags                              = {} -> null
      ~ url                               = "https://sqs.ca-central-1.amazonaws.com/687401027353/submission_processing.fifo" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # aws_sqs_queue.reliability_reprocessing_queue will be created
  + resource "aws_sqs_queue" "reliability_reprocessing_queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 900
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = 300
      + kms_master_key_id                 = "alias/aws/sqs"
      + max_message_size                  = 262144
      + message_retention_seconds         = 172800
      + name                              = "reliability_reprocessing_queue"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags_all                          = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 1800
    }

  # aws_sqs_queue.reprocess_submission_queue will be destroyed
  # (because aws_sqs_queue.reprocess_submission_queue is not in configuration)
  - resource "aws_sqs_queue" "reprocess_submission_queue" {
      - arn                               = "arn:aws:sqs:ca-central-1:687401027353:reprocess_submission_queue.fifo" -> null
      - content_based_deduplication       = true -> null
      - deduplication_scope               = "queue" -> null
      - delay_seconds                     = 900 -> null
      - fifo_queue                        = true -> null
      - fifo_throughput_limit             = "perQueue" -> null
      - id                                = "https://sqs.ca-central-1.amazonaws.com/687401027353/reprocess_submission_queue.fifo" -> null
      - kms_data_key_reuse_period_seconds = 300 -> null
      - kms_master_key_id                 = "alias/aws/sqs" -> null
      - max_message_size                  = 262144 -> null
      - message_retention_seconds         = 172800 -> null
      - name                              = "reprocess_submission_queue.fifo" -> null
      - receive_wait_time_seconds         = 0 -> null
      - redrive_policy                    = jsonencode(
            {
              - deadLetterTargetArn = "arn:aws:sqs:ca-central-1:687401027353:reliability_deadletter_queue.fifo"
              - maxReceiveCount     = 5
            }
        ) -> null
      - sqs_managed_sse_enabled           = false -> null
      - tags                              = {} -> null
      - tags_all                          = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
      - url                               = "https://sqs.ca-central-1.amazonaws.com/687401027353/reprocess_submission_queue.fifo" -> null
      - visibility_timeout_seconds        = 1800 -> null
        # (3 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.

Changes to Outputs:
  ~ sqs_reliability_dead_letter_queue_id   = "https://sqs.ca-central-1.amazonaws.com/687401027353/reliability_deadletter_queue.fifo" -> (known after apply)
  ~ sqs_reliability_deadletter_queue_arn   = "reliability_deadletter_queue.fifo" -> "reliability_deadletter_queue"
  ~ sqs_reliability_queue_arn              = "arn:aws:sqs:ca-central-1:687401027353:submission_processing.fifo" -> (known after apply)
  ~ sqs_reliability_queue_id               = "https://sqs.ca-central-1.amazonaws.com/687401027353/submission_processing.fifo" -> (known after apply)
  + sqs_reliability_reprocessing_queue_arn = (known after apply)
  + sqs_reliability_reprocessing_queue_id  = (known after apply)
  - sqs_reprocess_submission_queue_arn     = "arn:aws:sqs:ca-central-1:687401027353:reprocess_submission_queue.fifo" -> null
  - sqs_reprocess_submission_queue_id      = "https://sqs.ca-central-1.amazonaws.com/687401027353/reprocess_submission_queue.fifo" -> null

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_sqs_queue.api_audit_log_deadletter_queue"]
WARN - plan.json - main - Missing Common Tags: ["aws_sqs_queue.api_audit_log_queue"]
WARN - plan.json - main - Missing Common Tags: ["aws_sqs_queue.audit_log_deadletter_queue"]
WARN - plan.json - main - Missing Common Tags: ["aws_sqs_queue.audit_log_queue"]
WARN - plan.json - main - Missing Common Tags: ["aws_sqs_queue.reliability_deadletter_queue"]
WARN - plan.json - main - Missing Common Tags: ["aws_sqs_queue.reliability_queue"]
WARN - plan.json - main - Missing Common Tags: ["aws_sqs_queue.reliability_reprocessing_queue"]

26 tests, 19 passed, 7 warnings, 0 failures, 0 exceptions

```

</details>
